/* automatically generated by rust-bindgen 0.71.1 */

pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const INVALID_VALUE: u32 = 888888;
pub const CM_MAX_GROUP: u32 = 2;
pub const PARAM_SAMPLE_STATE: &[u8; 13] = b"sample_state\0";
pub const PARAM_SENSOR_GAIN: &[u8; 12] = b"sensor_gain\0";
pub const PARAM_EXPOSURE_TIME: &[u8; 14] = b"exposure_time\0";
pub const PARAM_AUTO_EXP: &[u8; 9] = b"auto_exp\0";
pub const PARAM_MAX_AUTO_EXP: &[u8; 13] = b"max_auto_exp\0";
pub const PARAM_AUTO_EXP_CHANNEL: &[u8; 17] = b"auto_exp_channel\0";
pub const PARAM_AUTO_LIGHT: &[u8; 11] = b"auto_light\0";
pub const PARAM_AUTO_LIGHT_MODE: &[u8; 16] = b"auto_light_mode\0";
pub const PARAM_LIGHT_VALUE: &[u8; 12] = b"light_value\0";
pub const PARAM_CONNECT_STATE: &[u8; 14] = b"connect_state\0";
pub const PARAM_ACTIVE_CHANNEL: &[u8; 15] = b"active_channel\0";

pub const Confocal_SignalSort_t_Signal_Sort_Far_To_Near: Confocal_SignalSort_t = 2;
pub type Confocal_SignalSort_t = ::std::os::raw::c_int;
pub const COMM_Protocol_Control_Enum_t_Hardware: COMM_Protocol_Control_Enum_t = 0;
pub const COMM_Protocol_Control_Enum_t_Software: COMM_Protocol_Control_Enum_t = 1;
pub type COMM_Protocol_Control_Enum_t = ::std::os::raw::c_int;
pub const COMM_Protocol_Enum_t_RS422_COMM: COMM_Protocol_Enum_t = 0;
pub const COMM_Protocol_Enum_t_RS485_COMM: COMM_Protocol_Enum_t = 1;
pub const COMM_Protocol_Enum_t_RS232_COMM: COMM_Protocol_Enum_t = 3;
pub type COMM_Protocol_Enum_t = ::std::os::raw::c_int;
pub const COMM_BaudRate_Enum_t_BaudRate_9600: COMM_BaudRate_Enum_t = 0;
pub const COMM_BaudRate_Enum_t_BaudRate_19200: COMM_BaudRate_Enum_t = 1;
pub const COMM_BaudRate_Enum_t_BaudRate_38400: COMM_BaudRate_Enum_t = 2;
pub const COMM_BaudRate_Enum_t_BaudRate_57600: COMM_BaudRate_Enum_t = 3;
pub const COMM_BaudRate_Enum_t_BaudRate_115200: COMM_BaudRate_Enum_t = 4;
pub const COMM_BaudRate_Enum_t_BaudRate_230400: COMM_BaudRate_Enum_t = 5;
pub const COMM_BaudRate_Enum_t_BaudRate_460800: COMM_BaudRate_Enum_t = 6;
pub const COMM_BaudRate_Enum_t_BaudRate_921600: COMM_BaudRate_Enum_t = 7;
pub const COMM_BaudRate_Enum_t_BaudRate_Max_Num: COMM_BaudRate_Enum_t = 8;
pub type COMM_BaudRate_Enum_t = ::std::os::raw::c_int;
pub const COMM_Parity_Enum_t_Even: COMM_Parity_Enum_t = 0;
pub const COMM_Parity_Enum_t_Odd: COMM_Parity_Enum_t = 1;
pub const COMM_Parity_Enum_t_Mark: COMM_Parity_Enum_t = 2;
pub const COMM_Parity_Enum_t_Space: COMM_Parity_Enum_t = 3;
pub const COMM_Parity_Enum_t_None: COMM_Parity_Enum_t = 7;
pub type COMM_Parity_Enum_t = ::std::os::raw::c_int;
pub const COMM_Data_Format_Enum_t_ASCII: COMM_Data_Format_Enum_t = 0;
pub const COMM_Data_Format_Enum_t_Hexadecimal: COMM_Data_Format_Enum_t = 1;
pub type COMM_Data_Format_Enum_t = ::std::os::raw::c_int;
pub const DataSetAttribute_t_Attribute_MinMax: DataSetAttribute_t = 0;
pub const DataSetAttribute_t_Attribute_Avg: DataSetAttribute_t = 1;
pub const DataSetAttribute_t_Attribute_PtP: DataSetAttribute_t = 2;
pub const DataSetAttribute_t_Attribute_STD: DataSetAttribute_t = 3;
pub type DataSetAttribute_t = ::std::os::raw::c_int;
pub const DeviceType_t_HPS_CF2000: DeviceType_t = 0;
pub const DeviceType_t_HPS_CF3000: DeviceType_t = 1;
pub const DeviceType_t_HPS_CF4000: DeviceType_t = 2;
pub const DeviceType_t_HPS_CF3000Lite: DeviceType_t = 3;
pub type DeviceType_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SC_ResultDataTypeDef_t {
    pub channelIndex: ::std::os::raw::c_int,
    pub saturation: f32,
    pub resultLen: ::std::os::raw::c_int,
    pub result: [f32; 10usize],
    pub distanceNumber: ::std::os::raw::c_int,
    pub distance: [f32; 20usize],
    pub signal: u64,
    pub signalLength: ::std::os::raw::c_int,
    pub triggerCount: i32,
    pub triggerCount1: i32,
    pub triggerCount2: i32,
    pub bTriggerPass: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SC_ResultDataTypeDef_t"][::std::mem::size_of::<SC_ResultDataTypeDef_t>() - 168usize];
    ["Alignment of SC_ResultDataTypeDef_t"]
        [::std::mem::align_of::<SC_ResultDataTypeDef_t>() - 8usize];
    ["Offset of field: SC_ResultDataTypeDef_t::channelIndex"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, channelIndex) - 0usize];
    ["Offset of field: SC_ResultDataTypeDef_t::saturation"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, saturation) - 4usize];
    ["Offset of field: SC_ResultDataTypeDef_t::resultLen"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, resultLen) - 8usize];
    ["Offset of field: SC_ResultDataTypeDef_t::result"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, result) - 12usize];
    ["Offset of field: SC_ResultDataTypeDef_t::distanceNumber"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, distanceNumber) - 52usize];
    ["Offset of field: SC_ResultDataTypeDef_t::distance"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, distance) - 56usize];
    ["Offset of field: SC_ResultDataTypeDef_t::signal"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, signal) - 136usize];
    ["Offset of field: SC_ResultDataTypeDef_t::signalLength"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, signalLength) - 144usize];
    ["Offset of field: SC_ResultDataTypeDef_t::triggerCount"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, triggerCount) - 148usize];
    ["Offset of field: SC_ResultDataTypeDef_t::triggerCount1"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, triggerCount1) - 152usize];
    ["Offset of field: SC_ResultDataTypeDef_t::triggerCount2"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, triggerCount2) - 156usize];
    ["Offset of field: SC_ResultDataTypeDef_t::bTriggerPass"]
        [::std::mem::offset_of!(SC_ResultDataTypeDef_t, bTriggerPass) - 160usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MC_ResultDataTypeDef_t {
    pub groupIndex: ::std::os::raw::c_int,
    pub channelResult: [SC_ResultDataTypeDef_t; 4usize],
    pub thickness: f32,
    pub resultLen: ::std::os::raw::c_int,
    pub triggerCount: i32,
    pub triggerCount1: i32,
    pub triggerCount2: i32,
    pub bTriggerPass: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MC_ResultDataTypeDef_t"][::std::mem::size_of::<MC_ResultDataTypeDef_t>() - 704usize];
    ["Alignment of MC_ResultDataTypeDef_t"]
        [::std::mem::align_of::<MC_ResultDataTypeDef_t>() - 8usize];
    ["Offset of field: MC_ResultDataTypeDef_t::groupIndex"]
        [::std::mem::offset_of!(MC_ResultDataTypeDef_t, groupIndex) - 0usize];
    ["Offset of field: MC_ResultDataTypeDef_t::channelResult"]
        [::std::mem::offset_of!(MC_ResultDataTypeDef_t, channelResult) - 8usize];
    ["Offset of field: MC_ResultDataTypeDef_t::thickness"]
        [::std::mem::offset_of!(MC_ResultDataTypeDef_t, thickness) - 680usize];
    ["Offset of field: MC_ResultDataTypeDef_t::resultLen"]
        [::std::mem::offset_of!(MC_ResultDataTypeDef_t, resultLen) - 684usize];
    ["Offset of field: MC_ResultDataTypeDef_t::triggerCount"]
        [::std::mem::offset_of!(MC_ResultDataTypeDef_t, triggerCount) - 688usize];
    ["Offset of field: MC_ResultDataTypeDef_t::triggerCount1"]
        [::std::mem::offset_of!(MC_ResultDataTypeDef_t, triggerCount1) - 692usize];
    ["Offset of field: MC_ResultDataTypeDef_t::triggerCount2"]
        [::std::mem::offset_of!(MC_ResultDataTypeDef_t, triggerCount2) - 696usize];
    ["Offset of field: MC_ResultDataTypeDef_t::bTriggerPass"]
        [::std::mem::offset_of!(MC_ResultDataTypeDef_t, bTriggerPass) - 700usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EventCallbackArgs_t {
    pub eventType: EventTypeDef,
    pub data: *mut ::std::os::raw::c_void,
    pub dataLen: ::std::os::raw::c_int,
    pub rid: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EventCallbackArgs_t"][::std::mem::size_of::<EventCallbackArgs_t>() - 24usize];
    ["Alignment of EventCallbackArgs_t"][::std::mem::align_of::<EventCallbackArgs_t>() - 8usize];
    ["Offset of field: EventCallbackArgs_t::eventType"]
        [::std::mem::offset_of!(EventCallbackArgs_t, eventType) - 0usize];
    ["Offset of field: EventCallbackArgs_t::data"]
        [::std::mem::offset_of!(EventCallbackArgs_t, data) - 8usize];
    ["Offset of field: EventCallbackArgs_t::dataLen"]
        [::std::mem::offset_of!(EventCallbackArgs_t, dataLen) - 16usize];
    ["Offset of field: EventCallbackArgs_t::rid"]
        [::std::mem::offset_of!(EventCallbackArgs_t, rid) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct version_t {
    pub year: ::std::os::raw::c_uchar,
    pub month: ::std::os::raw::c_uchar,
    pub day: ::std::os::raw::c_uchar,
    pub major: ::std::os::raw::c_uchar,
    pub minor: ::std::os::raw::c_uchar,
    pub rev: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of version_t"][::std::mem::size_of::<version_t>() - 6usize];
    ["Alignment of version_t"][::std::mem::align_of::<version_t>() - 1usize];
    ["Offset of field: version_t::year"][::std::mem::offset_of!(version_t, year) - 0usize];
    ["Offset of field: version_t::month"][::std::mem::offset_of!(version_t, month) - 1usize];
    ["Offset of field: version_t::day"][::std::mem::offset_of!(version_t, day) - 2usize];
    ["Offset of field: version_t::major"][::std::mem::offset_of!(version_t, major) - 3usize];
    ["Offset of field: version_t::minor"][::std::mem::offset_of!(version_t, minor) - 4usize];
    ["Offset of field: version_t::rev"][::std::mem::offset_of!(version_t, rev) - 5usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct KalmanFilterPara_t {
    pub kalman_k: f32,
    pub kalman_threshold: f32,
    pub num_check: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of KalmanFilterPara_t"][::std::mem::size_of::<KalmanFilterPara_t>() - 12usize];
    ["Alignment of KalmanFilterPara_t"][::std::mem::align_of::<KalmanFilterPara_t>() - 4usize];
    ["Offset of field: KalmanFilterPara_t::kalman_k"]
        [::std::mem::offset_of!(KalmanFilterPara_t, kalman_k) - 0usize];
    ["Offset of field: KalmanFilterPara_t::kalman_threshold"]
        [::std::mem::offset_of!(KalmanFilterPara_t, kalman_threshold) - 4usize];
    ["Offset of field: KalmanFilterPara_t::num_check"]
        [::std::mem::offset_of!(KalmanFilterPara_t, num_check) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DeviceInfo_t {
    pub serverIndex: ::std::os::raw::c_int,
    pub descriptor: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceInfo_t"][::std::mem::size_of::<DeviceInfo_t>() - 68usize];
    ["Alignment of DeviceInfo_t"][::std::mem::align_of::<DeviceInfo_t>() - 4usize];
    ["Offset of field: DeviceInfo_t::serverIndex"]
        [::std::mem::offset_of!(DeviceInfo_t, serverIndex) - 0usize];
    ["Offset of field: DeviceInfo_t::descriptor"]
        [::std::mem::offset_of!(DeviceInfo_t, descriptor) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ControllerGEPara_t {
    pub controllerIp: *mut ::std::os::raw::c_char,
    pub controllerMAC: *mut ::std::os::raw::c_char,
    pub controllerPort: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ControllerGEPara_t"][::std::mem::size_of::<ControllerGEPara_t>() - 24usize];
    ["Alignment of ControllerGEPara_t"][::std::mem::align_of::<ControllerGEPara_t>() - 8usize];
    ["Offset of field: ControllerGEPara_t::controllerIp"]
        [::std::mem::offset_of!(ControllerGEPara_t, controllerIp) - 0usize];
    ["Offset of field: ControllerGEPara_t::controllerMAC"]
        [::std::mem::offset_of!(ControllerGEPara_t, controllerMAC) - 8usize];
    ["Offset of field: ControllerGEPara_t::controllerPort"]
        [::std::mem::offset_of!(ControllerGEPara_t, controllerPort) - 16usize];
};
pub type UserEventCallbackHandle = ::std::option::Option<
    unsafe extern "C" fn(
        handler: DeviceHandle_t,
        arg: EventCallbackArgs_t,
        userPara: *mut ::std::os::raw::c_void,
    ),
>;
unsafe extern "C" {
    #[doc = " CF_ScanDeviceList\n  扫描传感器设备列表,适用于USB3.0系列控制器\n INPUT:\n\tdevList:\t\t返回当前所有设备\n\tdeviceNumber:\t返回设备个数\n\tRETURN:\t\t\t返回错误码"]
    pub fn CF_ScanDeviceList(
        devList: *mut *mut DeviceInfo_t,
        deviceNumber: *mut ::std::os::raw::c_int,
    ) -> StatusTypeDef;
}
unsafe extern "C" {
    #[doc = " CF_OpenDevice\n\t打开指定的光谱仪设备,适用于USB3.0系列控制器\n INPUT:\n\tdevice:\t\t\t用户指定的传感器设备\n\tdeviceHandler:\t返回该设备的句柄\n   mode:           DeviceType_t设备型号\n\tRETURN:\t\t\t返回错误码"]
    pub fn CF_OpenDevice(
        device: *mut DeviceInfo_t,
        deviceHandler: *mut DeviceHandle_t,
        model: DeviceType_t,
